const Yup = require("yup");

const coursesSchema = Yup.object().shape({
  unit: Yup.number()
    .typeError("لطفا تعداد واحد درس را به درستی وارد کنید")
    .required("تعداد واحد درس اجباری میباشد")
    .min(1, "حداقل تعداد واحد برای هر درس 1 میباشد")
    .max(6, "حداکثر تعداد واحد برای هر درس 6 میباشد"),
  name: Yup.string()
    .typeError("لطفا نام درس را به درستی وارد کنید")
    .required("نام درس اجباری میباشد")
    .min(4, "نام درس حداقل باید 4 کاراکتر باشد")
    .max(50, "نام درس نمیتواند بیشتر از 50 کاراکتر باشد"),
});

const courseUpdateSchema = Yup.object().shape({
  place: Yup.string().min(4, "مکان و زمان درس نمیتواند کمتر از 4 کاراکتر باشد").max(255, "مکان و زمان درس نمیتواند بیشتر از 255 کاراکتر باشد"),
  teacher: Yup.string().min(4, " نام استاد نمیتواند کمتر از 4 کاراکتر باشد").max(255, "نام استاد نمیتواند بیشتر از 255 کاراکتر باشد"),
  status: Yup.mixed().oneOf(["0", "1", "2"], "لطفا یکی از وضعیت های معلوم نیست پاس شده یا رد شده است را انتخاب کنید"),
  absence: Yup.number()
    .typeError("لطفا تعداد غیبت را درست وارد کنید")
    .min(0, "تعداد غیبت نمیتواند کمتر از 0 باشد")
    .max(16, "تعداد غیبت نمیتواند بیشتر از 16 باشد"),
  grade: Yup.number().typeError("لطفا نمره را درست وارد کنید").min(0, "نمره نمیتواند کمتر از 0 باشد").max(20, "نمره نمیتواند بیشتر از 20 باشد"),
  midterm: Yup.mixed().oneOf(["0", "1", "2"], "لطفا یکی از حالت های معلوم نیست دارد یا ندارد را انتخاب کنید"),
  midterm_text: Yup.string()
    .min(4, "توضیحات میان ترم نمیتواند کمتر از 4 کاراکتر باشد")
    .max(255, "توضیحات میان ترم نمیتواند بیشتر از 255 کاراکتر باشد"),
  presentation: Yup.mixed().oneOf(["1", "0"], "لطفا یکی از حالت های  دارد یا ندارد را انتخاب کنید"),
  presentation_text: Yup.string()
    .min(4, "توضیحات ارایه نمیتواند کمتر از 4 کاراکتر باشد")
    .max(255, "توضیحات ارایه نمیتواند بیشتر از 255 کاراکتر باشد"),
  project: Yup.mixed().oneOf(["1", "0"], "لطفا یکی از حالت های  دارد یا ندارد را انتخاب کنید"),
  project_text: Yup.string().min(4, "توضیحات پروژه نمیتواند کمتر از 4 کاراکتر باشد").max(255, "توضیحات پروژه نمیتواند بیشتر از 255 کاراکتر باشد"),
  description: Yup.string().min(4, "توضیحات  نمیتواند کمتر از 4 کاراکتر باشد").max(255, "توضیحات  نمیتواند بیشتر از 255 کاراکتر باشد"),
});

module.exports = {
  coursesSchema,
  courseUpdateSchema,
};
