<template>
    <div class="settingGuide mt-3">
        <h3>
            آموزش ها
        </h3>
        <div class="text-right">
            <p>
                برنامه <span class="text-danger">داشبورد من </span> از دو بخش اصلی و فرعی تشکیل شده است .
            </p>
            <p>
                بخش اصلی شامل کارهای روزانه ، نوشته های ماهانه ، مدیریت مالی ، مدیریت کتاب میباشد .
            </p>
            <p>
                بخش فرعی شامل مدیریت دانشگاه و امتحان ها ، مدیریت پروژه های برنامه نویسی میباشد .
            </p>
        </div>
        <div class="text-right">
            <h5>
                کارهای روزانه
            </h5>
            <p>
                در این بخش میتوانید کارهای روزانه خود را مدیریت کنید و برای خود برنامه ریزی کنید . 
            </p>
            <h5>
                نوشته های ماهانه
            </h5>
            <p>
                در این بخش میتوانید نوشته های ماهانه خود یا اهداف ماهیانه خود را بنویسید و مدیریت کنید .
            </p>
            <h5>
                مدیریت مالی
            </h5>
            <p>
                مدیریت مالی یکی از مهم ترین امور هر شخص میباشد ، در این بخش میتوانید امور مالی خود را مدیریت کنید .
            </p>
            <h5>
                کتاب
            </h5>
            <p>
                کتاب دوست همیشگی شماست ، در این بخش کتاب های خود را مدیریت کنید 
            </p>
            <h5>
                امتحان ها
            </h5>
            <p>
                فراموشی امتحان همیشه یکی از مشکلات ماست . در این بخش میتوانید امتحان های خود را مدیریت کنید .
            </p>
            <h5>
                دانشگاه
            </h5>
            <p>
                در این بخش تمامی موارد دانشگاه خود را میتوانید مدیریت کنید .
            </p>
            <h5>
                بوک مارک
            </h5>
            <p>
                در این بخش لینک های مورد علاقه خود را ذخیره کنید .
            </p>
            <p class="mt-4">
                اگر هرگونه مشکلی ، انتقادی یا پیشنهادی دارید لطفا با من در <router-link to="/Home/Setting/Contact">میان</router-link> بزارید .
            </p>
            <!-- <p class="mt-3">
                همچنین میتوانید بعضی از عملکرد های برنامه را در تنظیمات خود <router-link to="/Home/Setting/UserSetting">مدیریت</router-link> کنید .
            </p> -->
            <p>
                امیدوارم که از این برنامه لذت ببرید تمام تلاش خودم را میکنم که با آپدیت ها بیشتر این برنامه را هر روز بهتر از دیروز بکنم .
            </p>
        </div>
    </div>
</template>
<script>
export default {

}
</script>

